#Випадковим чином створити цілочисельний список, що складається з
#двозначних цілих чисел. Обчислити суму чисел цього списку. Суму
#чисел списку вставити в середину початкового списку, якщо його
#довжина – парне число, і в кінець, якщо його довжина непарна

import random

size = int(input('Введіть необхідну кількість значень списку -> '))
List = random.sample(range(10, 100), size)
S = sum(List)

if size % 2 == 0:
    print("'%-17s' -> '%s'" % ('Початковий список', List))
    List.insert(int(len(List)/2), S)
    print("'%-17s' -> '%s'" % ('Кінцевий список ', List))

if size % 2 == 1:
    print("'%-17s' -> '%s'" % ('Початковий список', List))
    List.append(S)
    print("'%-17s' -> '%s'" % ('Кінцевий список ', List))
