unit Unit5;

{$mode objfpc}{$H+}

interface

uses
  Classes, SysUtils, FileUtil;
 Const
 VariantArr:array[1..14] of String = (
 'Варіант 1. "Перестановки десяткових чисел  у лексикографічному порядку"',
 'Варіант 2. "Перестановоки десяткових чисел  у антилексикографічному порядку"',
 'Варіант 3. "Генерація двійкових векторів у лексикографічному порядку"',
 'Варіант 4. "Генерація двійкових векторів у антилексикографічному порядку"',
 'Варіант 5. "Генерація підмножин множини на основі генерації двійкових векторів"',
 'Варіант 6. "Генерація підмножин множини на основі генерації двійкових векторів"',
 'Варіант 7. "Формування коду Грея на основі першого алгоритму"',
 'Варіант 8. "Формування коду Грея на основі другого алгоритму"',
 'Варіант 9. "формування підмножин за першим алгоритмом генерації коду Грея"',
 'Варіант 10. "формування підмножин за другим алгоритмом генерації коду Грея"',
 'Варіант 11. "Сполучення з n по k  в лексикографічному порядку"',
 'Варіант 12. "Сполучення з n по k на множині в лексикографічному порядку"',
 'Варіант 13. "Сполучення з n по k на множині в лексикографічному порядку"',
 'Варіант 14. "Генерація розбиття числа n у словниковому порядку"');

 UpAtArr:array[1..37] of String = (
 'А','Б','В','Г','Ґ','Д','Е','Ё','Є','Ж','З','И','І','Ї','Й','К','Л','М','Н',
 'О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я');
 LowAtArr:array[1..37] of String = (
 'а','б','в','г','ґ','д','е','ё','є','ж','з','и','і','ї','й','к','л','м','н',
 'о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я');


type
  TDataLabModule = class(TDataModule)
  private
    { private declarations }
  public
    { public declarations }
  end;

var
  DataLabModule: TDataLabModule;
  NumVariant:Integer;  {Номер варіанта}
  NZK:Integer;         {Номер залікової книжки}
  CombElements:Integer; {Кількість елементів сполучення}
  NumElements:Integer;  {Кількість елементів у множині або у венкторі}
  SElements:Integer;    {Кількість згенерованих векторів або сполучень}
  MainNumber:Integer; {Число для варіанта 14}

implementation

{$R *.lfm}

end.

