"""Ввести з клавіатури координати точок A(x,y) і B(x,y). Визначити, яка з точок, A чи B, більше віддалена від початку
координат O(0,0). Відповідь вивести у вигляді повідомлення."""

print('Введите координаты точок А(х1,y1) и B(x2,y2)')
x1 = int(input('x1 = '))
y1 = int(input('y1 = '))
x2 = int(input('x2 = '))
y2 = int(input('y2 = '))

d1 = ((x1**2)+(y1**2))**(1/2)
d2 = ((x2**2)+(y2**2))**(1/2)

if d1 > d2:
    print('Точка A более удаленная от начала координат')
elif d2 > d1:
    print('Точка B более удаленная от начала координат')
elif d1 == d2:
    print('Точка А и В - равноудалены от начала координат')
