#ifndef MDB_STRING_H
#define MDB_STRING_H

/**
 * @file mdb_string.h
 * @brief Основні маніпуляції з рядком і перетворення рядка в 
 *	число типу <code>My_Double</code>.
 */

#include "my_double.h"
#include "adduction.h"

/**
 * @brief Функція перевіряє, чи є змінна <code>symbol</code> елементом масиву
 *	<code>bank</code> з індексом, не більшим <code>Radix</code>.
 * @param bank масив символів. Не може бути рівним <code>NULL</code>.
 * @param symbol символ.
 * @param Radix індекс. Не може бути меншим нуля.
 * @return 1, якщо такий елемент знайдений.
 * @return 0, якщо такий елемент  не знайдений.
 * @return -1, якщо неправильно передані параметри.
 */
int member(char * bank, char symbol, int Radix);

/**
 * @brief Пошук символа.
 *	Функція шукає символ <code>symbol</code> в масив символів
 *	<code>bank</code> і повертає його індекс в масиві.
 * @param bank масив символів. Не може бути рівним <code>NULL</code>.
 * @param symbol символ, який потрібно знайти.
 * @param size розмір масиву. Не може бути меншим нуля.
 * @return від 0 до <code>size</code> якщо елемент знайдений.
 * @return -1, якщо такий елемент  не знайдений.
 * @return -2, якщо неправильно передані параметри.
 */
int pos(char * bank, char symbol, int size);

/**
 * @brief Перетворення із строкового представлення в числове.
 *	Функція перетворює рядок символів <code>str</code> в число типу
 *	<code>My_Double</code> в системі числення з основою <code>Radix</code>.
 * @param pDbl вказівник на число типу <code>My_Double</code>. Не може бути пустим.
 * @param str вказівник на рядок. Не може бути пустим.
 * @param Radix основа системи числення. Має бути цілим числом від 2 до 16.
 * @return кількість символів, яке функція використовувала для запису із рядка в число.
 * @return -1, якщо в рядку забагато символів.
 * @return -2, якщо в рядку зустрівся символ, що не використовується в даній
 *	системі числення; або більше двох крапок в числі; або перед мінусом є інші символи.
 * @return -3, якщо неправильні параметри.
 */
int asc2dbl(My_Double * pDbl, const char * str, int Radix);

/**
 * @brief Перетворення із числового представлення в строкове.
 *	Функція формує рядок із числа <code>example</code> типу
 *  <code>My_Double</code> в системі числення з основою <code>Radix</code> і
 *	записує його в рядок <code>str</code>, але заповнюючи при цьому не більше,
 *	ніж <code>size</code> символів.
 * @param example число типу <code>My_Double</code>.
 * @param str вказівник на рядок. Не може бути пустим.
 * @param size кількість символів, які будуть заповнені.
 * @param Radix основа системи числення. Має бути цілим числом від 2 до 16.
 * @return кількість символів, записаних в рядок без знаку "-" і десяткової крапки.
 * @return 0, якщо розмір рядка <code>size</code> надто малий для того, щоб в
 *	нього записати число з заданою точністю.
 * @return -1, якщо неправильні параметри.
 */
int dblasc2(My_Double example, char * str, int size, int Radix);

#endif