import math as m
while True:
    print("Вітаю в програмі для здачі лабараторнгої роботи №2")
    print("""Яке завдання будемо вирішувати?
    1 - Обчислення виразу
    2 - Піднесення до квадрату додатніх чисел
    3.1 - Обчислення 1 послідовності через формулу суми n членів геометричної прогресії
    3.2 - Обчислення послідовностей""")
    quest = input("Введіть відповідне число: ")
########################################################################################
#           Початок завдання 1
########################################################################################
    if quest == "1":
        print("Вітаю вас в програмі для обрахування виразу")
        print("Увага!!! Всі невірно введені символи будуть прирівнюватись 0")
        print("Введіть будь ласка число x")
        try:
            x = float(input())
        except (ValueError, TypeError):
            x = float(0)
        print("Введіть будь ласка число y")
        try:
            y = float(input())
        except (ValueError, TypeError):
            y = float(0)
        print("Введіть будь ласка число z")
        try:
            z = float(input())
        except (ValueError, TypeError):
            z = float(0)
        doo1 = 7.8*x**2+3.52*y
        odz = x+2*z

        try:

            if odz <= 0:
                print("число логарифма має бути більшим від нуля")
            elif m.log(x+2*z, m.e)+m.e**y == 0:
                print("В школі казали на нуль ділити не можна")
            else:
                a = doo1/(m.log(x+2*z , m.e)+m.e**y)
                print("Відповідь: %.2f" % a)

        except (OverflowError):
            print ("Занадто великі числа")

        print("Давай рахувати ще!!!!!!!")
########################################################################################
#           Початок завдання 2
########################################################################################
    elif quest == "2":
        print("Вітаю в програмі для обчислення квадратів додатних чисел")
        print("Увага!!! Всі невірно введені символи будуть прирівнюватись 0")
        print("Введіть перше число")
        try:
            a = float(input())
        except (ValueError, TypeError):
            a = float(0)
        print("Введіть друге число")
        try:
            b = float(input())
        except (ValueError, TypeError):
            b = float(0)
        print("Введіть третє число")
        try:
            c = float(input())
        except (ValueError, TypeError):
            c = float(0)
        if a >= 0:
            aq = a*a
            print("Квадрат першого числа: %.2f" % aq)
        else:
            print("Число %2.f" % a , "від'ємне")
        if b >= 0:
            bq = b*b
            print("Квадрат другого числа: %.2f" % bq)
        else:
            print("Число %2.f" % b , "від'ємне")
        if c >= 0:
            cq = c*c
            print("Квадррат третього числа: %.2f" % cq)
        else:
            print("Число %2.f" % c , "від'ємне")
        print("Нумооо, я хочу більше рахувати!!!!!!")
########################################################################################
#           Початок завдання 3.1
########################################################################################
    elif quest == "3.1":
        print("Вітаю тебе в програмі для обчислення суми n членів геометричної прогресії перший член якої = 1")
        print("Увага!!! Всі невірно введені символи будуть прирівнюватись 0")
        print("Введіть знаменник геометричної прогресії")
        try:
            znam = float(input())
        except (ValueError, TypeError):
            znam = float(0)
        print("Введіть кількість члевнів прогресії")
        try:
            kilkist = int(input())
        except (ValueError, TypeError):
            kilkist = int(0)
        if kilkist < 0:
            print("Кількість членів може бути від*ємною?, я такого не знав")
        elif kilkist == 0:
            print("При знаменику рівному нулю відповідь буде рівна першому члену тобто 1")
        else:
            try:
                doo1 = ((1-znam**kilkist)/(1-znam))*znam+1
            except (OverflowError):
                print("Занадто велика послідовність, дуже тяжко порахувати")
                break
            print("Відповідь: %.2f" % doo1)
            print("Ну може ще одненьку прогресію?")
########################################################################################
#           Початок завдання 3.2
########################################################################################
    elif quest == "3.2":
        #Спочатку задаємо змінні на ввід
        print("Вітаю тебе в програмі для обчислення суми n членів деякої послідовності")
        print("Увага!!! Всі невірно введені символи будуть прирівнюватись 0")
        print("Введіть число яке буде показувати в скільки разів наступний член більший за попередній")
        try:
            pokaznik = float(input())
        except (ValueError, TypeError):
            pokaznik = float(0)
        print("Введіть кількість члевнів постідовності")
        try:
            kilkist = int(input())
        except (ValueError, TypeError):
            kilkist = int(0)
#заповнимо далі комірки з дійсними числами
        resultB = 1
        resultC = 1
        i = int(1)
        #Перевіряємо на парність
        CheckPar=float(0)
        #Використовуємо цикл
        if kilkist > 0:
            while i <= kilkist:
                try:
                    resultB = resultB+pokaznik**i
                except (OverflowError):
                    print('Занадто велика послідовність, дуже тяжко порахувати')
                    break
                CheckPar = m.fmod(i,2)
                if CheckPar != 0:
                    try:
                        resultC = resultC-pokaznik**i
                    except (OverflowError):
                        print('Занадто велика послідовність, дуже тяжко порахувати')
                else:
                    try:
                        resultC = resultC+pokaznik**i
                    except (OverflowError):
                        print('Занадто велика послідовність, дуже тяжко порахувати')
                i += 1
        else:
            print('Ви ввели неправильне число N')
        print("B = %.2f" % resultB)
        print("C = %.2f" % resultC)
        print("Я хочу більше послідовнеостей!!!!!")
    else:
        print("Ви не ввели число")
    print("Якщо бажаєте порахувати щось ще, нажміть Enter , якщо хочете закінчить введіть q")
    a = input()
    if a == "q":
        print("З вами було приємно мати справу")
        break
