           Anl    Bus, #C0H
           Ins    A, Bus
; Перевіряємо умову Х2, якщо 0, топродовжуємо, інакше переходимо
           Jb6    If2
;===============================================================
; Операторна вершина №1
; Формуємо сигнал Y5 (800 мкс)
           Orl    Bus, #E0H  ; Виводимо сигнал на шину
           ;Mov    A, #F9H
           ;Mov    T, A       ; Встановимо затримку в 720 мкс
           ;Strt   T          ; Запуск таймера
A0:
           ;Jtf    A1
           ;Jmp    A0
A1:
           Mov    R7, 11
A2:
           Djnz   R7, A2     ; Доводимо затримку до 800 vмкс
           Anl    Bus, #C0H  ; Скидаємо сигнал У1
;===============================================================
; Операторна вершина №2
Ov2:
; Формуємо сигнали У1 У3 У4 (720, 400 і 10 мкс відповідно)
           Orl    Bus, #DAH  ; Виводимо сигннали на BUS
           Mov    R7, 7
           Anl    Bus, #CAH  ; Скидаємо сигнал У4

           Mov    A, #FCH
           Mov    T, A       ; 320 мкс для У3

           Strt   T
B1:
           Jtf    B2
           Jmp    B1
B2:
           Mov    A, #FDH
           Mov    T, A       ; Ще 240 мкс для У1
           Nop
           Mov    R7, 7      ; Доводимо У3 до 400 мкс
B3:
           Djnz   R7, B3
           Anl    Bus, #C2H  ; Скидаємо сигнал У3

           Mov    R7, 11     ; Для доведення У3 до 720 мкс
           Strt   T          ; Запускаємо таймер (240 мкс) для У3
C0:
           Jtf    C1
           Jmp    C0
C1:
; Доводимо тривалість У3 до 720
           Djnz   R7, C1
           Mov    A, -8
           Mov    T, A       ; 640 мкс для У1 (операторна вершина №3)
           Anl    Bus, #C0H  ; Скидаємо сигнал У1
;===============================================================
; Операторна вершина №3
; Формуємо сигнал У1
           Orl    Bus, #C2H  ; Виводимо сигннали на BUS
           Strt   T          ; Запуск таймера (640 мкс)
D0:
           Jtf    D1
           Jmp    D0
D1:
; Доводимо тривалість до 720 мкс
           Mov    R7, 8
D2:
           Djnz   R7, D2
           Nop
           Anl    Bus, #C0H  ; Скидаємо сигнал У1
; Перехід у кінець програми
           Jmp    Exit
;===============================================================
If2:
; Перевіряємо Х1, якщо 0, то переходимо у операторнну вершину №2, 
; інакше продовжуємо
           Jb7    Ov4
           Jmp    Ov2
;===============================================================
; Операторна вершина №4
Ov4:
           Mov    A, #FCH
           Orl    Bus, #D8H  ; Встановлюємо сигнали У3 і У4
           Mov    T, A       ; Затримка 320 мкс (для У4)
           Nop
           Anl    Bus, #D0H  ; Скидаємо сигнал У4
           Mov    R7, 10
E0:
           Djnz   R7, E0     ; Доводимо до 80 мкс
           Nop
           Strt   T          ; Запуск таймера (320 мкс)
E1:
           Jtf    E2
           Jmp    E1
E2:
           Anl    Bus, #C0H  ; Скидаємо сигнал У3
;===============================================================
; Кінець програми
Exit:
           Nop
