ministry = ['Міністерство аграрної політики та продовольства України', 'Міністерство внутрішніх справ України',
'Міністерство екології та природних ресурсів України', 'Міністерство економічного розвитку і торгівлі України',
'Міністерство енергетики та вугільної промисловості України', 'Міністерство закордонних справ України',
'Міністерство інформаційної політики України', 'Міністерство інфраструктури України',
'Міністерство культури України','Міністерство молоді та спорту України', 'Міністерство оборони України',
'Міністерство освіти і науки України', "Міністерство охорони здоров'я України",
'Міністерство регіонального розвитку, будівництва та житлово-комунального господарства України',
'Міністерство соціальної політики України', 'Міністерство фінансів України', 'Міністерство юстиції України',
'Міністерство з питань тимчасово окупованих територій та внутрішньо переміщених осіб України']
# print("Cписок всех министерств:")
short_min = ['Мінагрополітики', 'МВС', 'Мінприроди', 'Мінекономрозвитку', 'Міненерговугілля', 'МЗС', 'МІП',
'Мінінфраструктури', 'Мінкультури', 'Мінмолодьспорт', 'Міноборони', 'МОН', 'МОЗ', 'Мінрегіон', 'Мінсоцполітики',
'Мінфін', "Мін'юст", 'МТОТ']

# for i,a,b in zip(range(1, len(ministry)+1), ministry, short_min,):
#         print(str(i)+"."+a+"("+b+")")
# print()

telephone = ['+38699186746','+3853207241090','+38916598285','+38038856399','+387769619910','+388649321351',
'+38467581357','+384464849603','+380660221690','+384954329793','+38784949905','+38082433872','+385776570758',
'+3898384485327','+3861641918783','+388100953837','+382260412155','+38461456376']
email = ['hotline@minagro.gov.ua', 'vidkrytist@mvs.gov.ua', 'gr_priem@menr.gov.ua', 'meconomy@me.gov.ua',
'pkr@mev.gov.ua', 'cons@mfa.gov.ua', 'info@mip.gov.ua', 'press@mtu.gov.ua', 'public_info@mincult.gov.ua',
'g.liniya@msms.gov.ua', 'admou@mil.gov.ua', 'press@mon.gov.ua', 'moz@moz.gov.ua', 'press@minregion.gov.ua',
'info@mlsp.gov.ua', 'infomf@minfin.gov.ua', 'callcentre@minjust.gov.ua', 'info@mtot.gov.ua']
surname = ['Кутовий', 'Аваков', 'Семерак', 'Кубів', 'Насалик', 'Клімкін', 'Стець', 'Омелян', 'Нищук', 'Жданов',
'Полторак', 'Гриневич', 'Супрун', 'Зубко', 'Рева', 'Данилюк', 'Петренко', 'Черниш']

value = zip(telephone,email,surname)
# input1 = input("Введите фамилию министра: ")
dict1 = {c:d for (c,d) in zip(short_min,value)}
# for key in dict1.keys():
#     if input1 == dict1[key][2]:
#         print("Данный министр работает в этом министерстве: " + key)
# print()

# input2 = input("Введите название министерства: ")
# for key in dict1.keys():
#     if input2 == key:
#         print("Телефон министерства: " + dict1[key][0])
#         print("E-mail министерства: " + dict1[key][1])
