/*
C2 = 6116 % 2 = 0 => Інтерфейс List
C3 = 6116 % 3 = 2 => Двозв’язний список
Створити клас, що описує типізовану колекцію (типом колекції є узагальнений клас з лабораторної роботи №6),
що реалізує заданий варіантом інтерфейс (п.2) та має задану внутрішню структуру (п.3). Реалізувати всі методи інтерфейсу,
а також створити не менше ніж 3 конструктори (1 – порожній, 2 – в який передається 1 об’єкт узагальненого класу,
3 – в який передається стандартна колекція об’єктів). Всі початкові дані задаються у виконавчому методі.
 */
public class Main {
}
