enum ltrType
{dgt,	  //0 десяткова цифра
 ltrexplt,//1 літера-ознака експоненти
 ltrhxdgt,//2 літера-шістнадцяткова цифра
 ltrtpcns,//3 літера-визначник типу константи
 ltrnmelm,//4 літери, які припустимі тільки в іменах
 ltrstrlm,//5 літери для обмеження рядків і констант
 ltrtrnfm,//6 літери початку перекодування літер рядків
 nc,      //7 некласифіковані літери 
 dldot,   //8 точка як роздільник та літера констант
 ltrsign, //9 знак числа або порядку
 dlmunop, //10 поодинокі роздільники операцій
 dlmgrop, //11 елемент групового роздільника
 dlmbrlst,//12 роздільники елементів списків
 dlobrct, //13 відкриті дужки
 dlcbrct, //14 закриті дужки
 dlmeorml,//15 кінець обмеженого коментаря
 dlmeormr,//16 кінець коментаря-рядку
 dlmaux,  //17 допоміжні роздільники типа пропусків
 ltrcode=18// ознака можливості вісімкового кодування
};
enum autStat
{Eu,	//0 Eu - Некласифікований об'єкт
 S0,	//1 S0 - Роздільник
 S1g,	//2 S1g - Знак числової константи
 S1c,	//3 S1c - Ціле число
 S2c,	//4 S2c - Число з точкою
 S1e,	//5 S1e - Літера "e" або "E"
 S1q,	//6 S1q - Знак "-" або "+"
 S1p,	//7 S1p - Десяткові цифри порядку
 S1n,	//8 S1n - Елементи імені
 S1s,	//9 S1s - Літери рядка або символьної константи
 S1t,	//10 S1t - Елементи констант, які перетворюються 
 S2s,	//11 S2s - Ознака закінчення константи
 S2,	//12 S2 - Початковий елемент групового роздільника
 S3,	//13 S3 - Наступний елемент групового роздільника
 S3c,	//14?S3c - Ціле число з недесятковою основою
 S0p,	//15?S0p - Ознака типу константи
 Soc,	//16 Soc- Вісімковий код
 Scr,	//17 Scr- Коментар-рядок
 Scl,	//18 Scl- Обмежений коментар
 Ec,	//19 Ec - Неправильна константа
 Ep,	//20 Ep - Неправильна константа з точкою
 Eq,	// Eq - Неправильна константа з порядком
 En,	// En - Неправильне ім'я
 Eo	// Eo - Неприпустиме сполучення операцій
};
