import re # Підключаємо модуль
d = "29,12.2016"  # Замість крапки вказана кома
p = re.compile(r"^[0-3][0-9].[01][0-9].[12][09][0-9][0-9]$")
if p.search(d): print("Дaтa введена правильно")
else: print("Дaтa введена неправильно")
p = re.compile(r"^[0-3][0-9]\.[01][0-9]\.[12][09][0-9][0-9]$")
if p.search(d): print("Дaтa введена правильно")
else:   print("Дaтa введена неправильно")
р = re.compile (r"^[0-3][0-9][.][01][0-9][.][12][09][0-9][0-9]$")
if р. search(d):   print("Дaтa введена правильно")
else:  print("Дaтa введена неправильно")
