public class Main {
    public static void main(String[] avg){
        /*
        Передається (лямбда, лямбда1, лямбда2, р, затримка для RR)
        Більш коректно передавати (лямбда, ню1, ню2, р, затримка для RR)
        Тому я йому кажу: ню1 = 1\лямбда1 й тд (бо формули зав`язані на лямбді для t)

        TEST1
        Він задає 0.9-1-0.5-0.7(тут байдуже що)-0.1(також байдуже) => (0.9-1-2-0.7-0.1) - так треба записати (оберенено 0.5)
        Мат очікування для FIFO = RR ~= 10

        TEST2
        Він задає 0.7-1-0.5-0.7(тут байдуже що)-0.1(також байдуже) => (0.7-1-2-0.7-0.1) - так треба записати (оберенено 0.5)
        Мат очікування для FIFO = RR ~= 3.3333(3)

        PS: для будь-якої СМО по заданим параметрам будуть такі ж мат очікування (бо на виході експоненційний закон й так формули однакові)
         */
        Handler hand = new Handler(0.7,1,2, 0.7, 0.1);
        hand.generateSteps(10000);
        //hand.generateTime(2000);
        hand.hand();
    }
}
