""" Випадковим чином створити цілочисельний список, що складається з двозначних цілих чисел.
Обчислити суму чисел цього списку. Суму чисел списку вставити в середину початкового списку,
якщо його довжина – парне число, і в кінець, якщо його довжина непарна. """

from random import randrange

l = randrange(1, 10)
text = [randrange(10, 100) for i in range(l)]
print('Випадковий згенерований список:', text)

s = sum(i for i in text)
print('\nСума чисел списку = ', s)

if len(text) % 2 == 0:
    text.insert(int(len(text)/2), s)
    print('\nСписок містить', len(text)-1,
          'елементи(-ів), отже довжина парна, тому сума додається всередину списку:\n', '%20s' % text)
else:
    text.append(s)
    print('\nСписок містить', len(text)-1,
          'елементи(-ів), отже довжина непарна, тому сума додається в кінець списку:\n', '%20s' % text)
