""" Згенерувати матрицю A(m,n) розмірністю m×n з випадкових елементів, що є цілими числами.
Побудувати список, елементами якого є середнє арифметичне рядків матриці """

from random import randrange

new = []
n = int(input('Задайте кількість рядків для матриці:\n'))
m = int(input('Задайте кількість стовпців для матриці:\n'))
A = [[randrange(1, 10) for j in range(m)] for i in range(n)]
print('Випадково згенерована матриця:\n', A, '\n')

for i in range(n):
    """Вивід матриці"""
    print('%30s' % A[i])

for k in range(n):
    """Додавання в новий список елементів(середнього арифметичного рядків)"""
    new.append(round(sum(i for i in A[k])/m, 2))
print('\nСписок, елементами якого є середнє арифметичне рядків матриці:\n', '%30s' % new)
