#include <stdio.h>
#include <conio.h>
#include <locale.h>

int main()
{
    float x, y;
    setlocale(LC_ALL, "ukr");
    printf("Варiант 22. Дана програма зчитує введене користувачем значення змiнної x i виводить на екран вiдповiдне значення y(x).\nНатиснiть будь-яку клавiшу для початку.");
    getch();
    do
    {
        system("cls");
        printf("Будь ласка введiть змiнну x i натиснiть 'Enter':\nx=");
        if(!(scanf("%f", &x)))                          /*перевірка, чи є введене значення числом*/
        {
            printf("Ви ввели символ. Будь ласка натиснiть будь-яку клавiшу й спробуйте знову.");
            getch();
            x=0;
            fflush(stdin);
        }
    }
    while(!x);

    if((0<x)&&(x<=5))
    {
        y=x*x*x-5*x*x;
        printf("y=%.2f", y);
    }
    if(((-32<=x)&&(x<-20))||(x>10))
    {
        y=x*x-3;
        printf("y=%.2f", y);
    }
    if((!((0<x)&&(x<=5)))&&(!(((-32<=x)&&(x<-20))||(x>10)))) printf("Для заданого значення x функцiя y(x) не iснує.");
    getch();
    printf("\nПрограма успiшно завершена.");
}

