class MyClass:
    x = 10  # Атрибут класу
    def __init__(self):
         self.y = 20 # Атрибут екземпляра класу
# Тепер створимо два екземпляри цього класу:
c1 = MyClass() # Створюємо екземпляр класу
c2 = MyClass() # Створюємо екземпляр класу
print(c1.x, c2.x) # 10 10
MyClass.x = 88 # Змінюємо атрибут класу
print(c1.x, c2.x) # 88 88
#Тепер зробимо аналогічну операцію з атрибутом y:
print(c1.y, c2.y)  # 20 20
c1.y = 88 # Змінюємо атрибут екземпляра класу
print(c1.y, c2.y) # 88 20
